[
  {
    "content": "\n\t\tThe concept of extension service dates back up to 4,000 years ago and has evolved into an idea that now encompasses a wide range of social, political, and commercial activities that seek to improve the abilities of the average farmer to adopt more appropriate and new practices in their operations. The goal is so that farmers can learn and adapt to the changing operational conditions and societal needs. Despite the evolution of extension services, there are important elements that have been constant in what makes up extension service and its delivery over the years.\nThese elements are:\nInformation – This is the bedrock of extension service because farmers primarily need the right information at the right time and in the right quantity to be able to make operational decisions from production to sales. For an effective extension service delivery, information should be given in a curated and actionable manner to make it easy for farmers to apply the knowledge.\nTime-tested and Up-to-date Information – The information given must be based on the various experiences from tested and proven farming techniques suited to the environment of the farmer. From time to time, farming techniques are improved upon or totally changed through information gotten from research, the delivery system must also include these new findings.\nExperts – It is important that professionals like agronomists and soil scientists are involved in the delivery of extension services. This is to ensure that the information given are from reliable sources and can be communicated in the best way a farmer can understand and apply.\nMeans of Delivery – This is an important element of any extension service delivery framework because it is what determines if the information gets to the farmers in a way that they can use. For an effective delivery system, there must be a delivery system that is accessible, accurate, and affordable.\nYou would agree that the desired result of an efficient extension service delivery is for farmers to have easy access to the right information, at the right time to support their decision-making on operational activities that can help improve their productivity. The primary aim is to provide farmers with information and advice they can apply to support their operations.\nAll across the globe, extension services are predominantly delivered by the government in collaboration with research institutes and farmers’ organizations. With more research, you will observe that whilst this collaborative framework has proven effective for the most part, it has also proven to be a major problem in the efficient delivery of extension services, especially where the framework is not effectively managed to adapt to the ever-evolving agricultural sector.\nNigeria has its extension services framework that is set up to provide farmers with the needed extension services. In our subsequent posts, we will be discussing Nigeria’s extension service framework in order to understand how it is set up to deliver this essential agricultural service to farmers.\n \n \n\t",
    "image": "",
    "title": "\n\t\t<div class=\"entry-meta\"><span class=\"screen-reader-text\">Posted on</span> <a href=\"https://growng.company/blog/the-concept-of-extension-services/\" rel=\"bookmark\"><time class=\"entry-date published\" datetime=\"2022-03-30T10:32:03+01:00\">March 30, 2022</time><time class=\"updated\" datetime=\"2022-04-05T16:16:30+01:00\">April 5, 2022</time></a></div><!-- .entry-meta --><h3 class=\"entry-title\"><a href=\"https://growng.company/blog/the-concept-of-extension-services/\" rel=\"bookmark\">The Concept of Extension Services</a></h3>\t"
  }
]