[
  {
    "content": "\n\t\tIn our last post, we touched on the 4 elements that make up an effective extension service delivery system. These elements can be identified in the extension delivery system here, in Nigeria.\nLet’s break it down for you.\nNigeria’s modern extension service delivery system has a traceable history that dates back to the 1890s during the colonial era. The extension delivery system in Nigeria has been influenced by different political, economic, and social evolutions. These evolutions have defined the concept of what it is now, the problem it is solving, and how it is being delivered to farmers today.\nNigeria’s extension service delivery system can be categorized into 2 main parts, namely the Colonial era and the Post-colonial era. Whilst the primary purpose in both eras was to educate farmers, the means and the objective differed.\nThe Colonial Era (When the White Man came)\nThe colonial extension services system brought about the evolution of farming from rudimentary farming to scientific farming. The extension service delivery system at the time focused on export products like cocoa, palm oil, and cotton in order to support the agro-industries in Europe. Some of the extension service programs implemented include The Colonial Commodity Extension Approach and The Ministry of Agriculture Approach which focused on the establishment of agricultural research stations across the colony. In the era, the idea was right but the objective was not to support farmers’ operational activities.\nPost-colonial Era (After the White Man left)\nThe post-colonial extension service era started with some innovative programs geared toward creating an effective extension service delivery system that supported farmers with agricultural information and technology development.  Some of these programs included The Farm Settlement Institute Leavers Extension Strategy; The National Accelerated Food Production Program; and Operation Feed the Nation (OFN). These were laudable extension service programs that were good-intentioned but ultimately failed mainly because of two reasons: The discovery of crude oil and the lack of political will on the part of the government to follow through on these programs. If you were privileged to benefit from some of these programs, or you have an idea of how they were set up, feel free to share in our comment section to educate the young farmers within this community.\nThe oil boom brought about a shift of focus away from agriculture as the main source of revenue for the government which meant that the agricultural sector did not get the adequate political and financial attention it needed to thrive. With the government being, and still, the primary provider of agricultural extension services, the farmers’ support system became weak and almost non-existent. Policies were made, almost as an after-thought and were not diligently implemented. The last known major attempt to revamp the extension service delivery was through the establishment of the Agricultural Development Programs (ADPs).\nThe extension services delivery system in Nigeria has evolved from a rudimentary, export crop-focused service to what can be regarded as a professional service with the establishment of ADPs even though its efficiency has been below average at best. In our next post, we will discuss the concept of ADPs and how it has been used over the years for extension service delivery. If you have benefited from this program, we want to hear about your experience. So please share in our comment section to give readers an idea of the program before our next post.\n\t",
    "image": "\n\t\t\t\t<a class=\"post-thumbnail-inner alignwide\" href=\"https://growng.company/blog/the-evolution-of-extension-services-in-nigeria/\" aria-hidden=\"true\" tabindex=\"-1\">\n\t\t\t\t\t<img width=\"1568\" height=\"936\" src=\"https://growng.company/blog/wp-content/uploads/2022/03/1.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" srcset=\"https://growng.company/blog/wp-content/uploads/2022/03/1.jpg 1679w, https://growng.company/blog/wp-content/uploads/2022/03/1-300x179.jpg 300w, https://growng.company/blog/wp-content/uploads/2022/03/1-1024x611.jpg 1024w, https://growng.company/blog/wp-content/uploads/2022/03/1-768x458.jpg 768w, https://growng.company/blog/wp-content/uploads/2022/03/1-1536x917.jpg 1536w\" sizes=\"(max-width: 1568px) 100vw, 1568px\">\t\t\t\t</a>\n\t\t\t",
    "title": "\n\t\t<h2 class=\"entry-title\"><a href=\"https://growng.company/blog/the-evolution-of-extension-services-in-nigeria/\" rel=\"bookmark\">The Evolution of Extension Services In Nigeria</a></h2>\t"
  },
  {
    "content": "\n\t\tThe concept of extension service dates back up to 4,000 years ago and has evolved into an idea that now encompasses a wide range of social, political, and commercial activities that seek to improve the abilities of the average farmer to adopt more appropriate and new practices in their operations. The goal is so that farmers can learn and adapt to the changing operational conditions and societal needs. Despite the evolution of extension services, there are important elements that have been constant in what makes up extension service and its delivery over the years.\nThese elements are:\nInformation – This is the bedrock of extension service because farmers primarily need the right information at the right time and in the right quantity to be able to make operational decisions from production to sales. For an effective extension service delivery, information should be given in a curated and actionable manner to make it easy for farmers to apply the knowledge.\nTime-tested and Up-to-date Information – The information given must be based on the various experiences from tested and proven farming techniques suited to the environment of the farmer. From time to time, farming techniques are improved upon or totally changed through information gotten from research, the delivery system must also include these new findings.\nExperts – It is important that professionals like agronomists and soil scientists are involved in the delivery of extension services. This is to ensure that the information given are from reliable sources and can be communicated in the best way a farmer can understand and apply.\nMeans of Delivery – This is an important element of any extension service delivery framework because it is what determines if the information gets to the farmers in a way that they can use. For an effective delivery system, there must be a delivery system that is accessible, accurate, and affordable.\nYou would agree that the desired result of an efficient extension service delivery is for farmers to have easy access to the right information, at the right time to support their decision-making on operational activities that can help improve their productivity. The primary aim is to provide farmers with information and advice they can apply to support their operations.\nAll across the globe, extension services are predominantly delivered by the government in collaboration with research institutes and farmers’ organizations. With more research, you will observe that whilst this collaborative framework has proven effective for the most part, it has also proven to be a major problem in the efficient delivery of extension services, especially where the framework is not effectively managed to adapt to the ever-evolving agricultural sector.\nNigeria has its extension services framework that is set up to provide farmers with the needed extension services. In our subsequent posts, we will be discussing Nigeria’s extension service framework in order to understand how it is set up to deliver this essential agricultural service to farmers.\n \n \n\t",
    "image": "\n\t\t\t\t<a class=\"post-thumbnail-inner alignwide\" href=\"https://growng.company/blog/the-concept-of-extension-services/\" aria-hidden=\"true\" tabindex=\"-1\">\n\t\t\t\t\t<img width=\"1024\" height=\"647\" src=\"https://growng.company/blog/wp-content/uploads/2022/03/agric-ext-2.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://growng.company/blog/wp-content/uploads/2022/03/agric-ext-2.webp 1024w, https://growng.company/blog/wp-content/uploads/2022/03/agric-ext-2-300x190.webp 300w, https://growng.company/blog/wp-content/uploads/2022/03/agric-ext-2-768x485.webp 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\">\t\t\t\t</a>\n\t\t\t",
    "title": "\n\t\t<h2 class=\"entry-title\"><a href=\"https://growng.company/blog/the-concept-of-extension-services/\" rel=\"bookmark\">The Concept of Extension Services</a></h2>\t"
  }
]